#+title: Elementwise Add Kernel in CUDA
#+author: Chunwei Yan
#+date: 2025-08-12
#+hugo_tags: "cuda" "basics" "tech"
#+hugo_draft: false
#+toc: nil

In this post, I will walk through the reduce kernels in [[https://github.com/xlite-dev/LeetCUDA/tree/main/kernels][LeetCUDA]] and implement them interactively in this file using org-executor.

** PyTorch
The python version:

#+begin_src python :file ./_torch_check.py :command python3 %f :exports both
import torch
print(torch.__version__)
#+end_src
#+RESULTS:
  2.8.0a0+5228986c39.nv25.06



